{
  "users": [
    {
      "id": "1",
      "createdAt": "2011-01-01 00:00:00",
      "username": "exampleUser",
      "password": "examplePassword",
      "timezone": 2
    },
    {
      "id": "99166adc-3764-452a-90ba-2eeba11d9937",
      "email": "admin@projekti.fi",
      "password": "salsana123",
      "createdAt": 1701165865117,
      "timezone": -120
    },
    {
      "id": "b9838980-bd2a-4bdc-8766-825752e67d6c",
      "email": "user@projekti.fi",
      "password": "vahvaSalasana",
      "createdAt": 1701166315723,
      "timezone": -120
    }
  ],
  "todos": [
    {
      "id": "aefff4e4-b071-4f53-a56d-7bc3d42108f4",
      "userId": "1",
      "createdAt": 1700809684780,
      "editedAt": 1701155836576,
      "doneBy": 1703447940000,
      "content": "Have a great Christmas! ",
      "subtasks": [],
      "repeatInterval": "never",
      "todo": false,
      "deadline": true,
      "done": false,
      "tag": "3"
    },
    {
      "id": "3ca66892-1e02-416c-9614-6d9268325ad3",
      "userId": "1",
      "createdAt": 1700809767237,
      "editedAt": 1700809767237,
      "doneBy": 1700809747107,
      "content": "Send message to aliens and take over the world!",
      "subtasks": [],
      "repeatInterval": "never",
      "todo": false,
      "deadline": false,
      "done": false,
      "tag": "4"
    },
    {
      "id": "31d657d2-91df-4634-bdc0-697e37c0364a",
      "userId": "1",
      "createdAt": 1700809793229,
      "editedAt": 1700855781228,
      "doneBy": 1700809769683,
      "content": "Have a movie marathon!",
      "subtasks": [
        {
          "id": "6f2b8510-47e1-492b-a167-4dc882497812",
          "content": "Jurassic Park",
          "done": true
        },
        {
          "id": "ba9bbb47-e5ec-4e07-b85b-dc4479b5e0ab",
          "content": "The Lost World: Jurassic Park II",
          "done": false
        },
        {
          "id": "3e555d66-a42e-4135-bd22-43070ef90f19",
          "content": "Jurassic Park III",
          "done": false
        }
      ],
      "repeatInterval": "never",
      "todo": true,
      "deadline": false,
      "done": false,
      "tag": "8"
    },
    {
      "id": "5814ddce-6581-48d1-af98-5b12535b00cb",
      "userId": "1",
      "createdAt": 1700809865839,
      "editedAt": 1700855774549,
      "doneBy": 1704139140000,
      "content": "Have a new year pizza party!",
      "subtasks": [],
      "repeatInterval": "never",
      "todo": false,
      "deadline": true,
      "done": false,
      "tag": "5"
    },
    {
      "id": "db773395-b8dc-426b-b5c5-9002fae47a45",
      "userId": "1",
      "createdAt": 1700812596913,
      "editedAt": 1700855784442,
      "doneBy": 1700222400000,
      "content": "Remember to buy",
      "subtasks": [
        {
          "id": "de175bec-1190-4040-a22f-d4ce24034b90",
          "content": "Milk",
          "done": true
        },
        {
          "id": "f0126365-9f2a-4291-9e73-f0e0cf928e49",
          "content": "Envelopes",
          "done": true
        },
        {
          "id": "bdb86375-ddb7-4bfb-a1f3-ba635ed07243",
          "content": "Apples",
          "done": false
        }
      ],
      "repeatInterval": "never",
      "todo": true,
      "deadline": true,
      "done": false,
      "tag": "1"
    },
    {
      "id": "ab096b21-3d0f-4f74-baa2-1cf09afcedee",
      "userId": "1",
      "createdAt": 1701161888917,
      "editedAt": 1701162293252,
      "doneBy": 1701766604300,
      "content": "Grocery list",
      "subtasks": [
        {
          "id": "bb914d33-7203-4c41-946f-f869393db57d",
          "content": "Salad",
          "done": true
        },
        {
          "id": "289a0138-baab-4304-b05d-9b166cd7bf3e",
          "content": "Bread",
          "done": false
        }
      ],
      "repeatInterval": "never",
      "todo": true,
      "deadline": true,
      "done": false,
      "tag": "9"
    },
    {
      "id": "0a3d1997-e6ab-42f6-88b2-ff61def7d8dd",
      "userId": "1",
      "createdAt": 1701164306961,
      "editedAt": 1701164306961,
      "doneBy": 1701344700000,
      "content": "Water plants",
      "subtasks": [],
      "repeatInterval": "never",
      "todo": false,
      "deadline": true,
      "done": false,
      "tag": "10"
    },
    {
      "id": "4cdcfa37-83e8-4b94-8b60-2498ee40fe4e",
      "userId": "1",
      "createdAt": 1701165104350,
      "editedAt": 1701165110886,
      "doneBy": 1694502000000,
      "content": "Buy birthday gift for a friend",
      "subtasks": [],
      "repeatInterval": "never",
      "todo": true,
      "deadline": true,
      "done": true,
      "tag": "3"
    },
    {
      "id": "1e8ff854-998c-400a-b389-0f6715934665",
      "userId": "1",
      "createdAt": 1701165166081,
      "editedAt": 1701165166081,
      "doneBy": 1700499600000,
      "content": "Wash windows",
      "subtasks": [],
      "repeatInterval": "never",
      "todo": true,
      "deadline": true,
      "done": true,
      "tag": "1"
    }
  ],
  "memos": [
    {
      "id": "1",
      "userId": "1",
      "title": "Awesome memo",
      "content": "Donec quam magna, ullamcorper sit amet blandit vel, \n lobortis vitae odio. Nulla molestie, massa eget rutrum feugiat, lorem sem consectetur augue, non blandit nibh enim eu arcu. Nullam id nulla odio. Proin luctus tincidunt porttitor. Nulla ac vehicula nulla, condimentum varius felis. Aliquam suscipit sodales leo sed suscipit. Sed nec velit arcu. Nam eu lectus diam. Pellentesque rhoncus mattis tincidunt. Maecenas molestie, velit vel auctor fringilla, nibh metus venenatis mauris, eget dignissim ex velit ut sem. Donec et quam fringilla, mattis massa eget, dignissim sem. Proin in ligula eget augue porta hendrerit. Curabitur fermentum blandit lorem nec vehicula. Maecenas semper, neque et commodo finibus, eros mauris tincidunt dolor, eu mattis ex erat eu neque. Proin id mi tortor. Praesent tempor, nunc at tincidunt pretium, ligula tortor tincidunt enim, vestibulum finibus ex purus quis mauris. Curabitur at erat vehicula ex luctus consequat. Nullam eu est ut lectus aliquet lobortis. Phasellus est nibh, euismod vel purus ac, sollicitudin lobortis velit. Donec vestibulum lectus a mauris lobortis, non sodales augue varius. Morbi commodo nisl ligula, sit amet varius libero egestas at. Nulla lacinia venenatis ipsum, quis porttitor lacus condimentum in. Nullam suscipit diam non iaculis aliquam. Nam hendrerit, massa eu bibendum pretium, augue sem sollicitudin libero, sed auctor magna quam eu ex. Suspendisse potenti. Nulla in tincidunt lorem, eget egestas magna. Duis volutpat pulvinar nunc, sit amet venenatis lectus sollicitudin vitae. In vel facilisis libero. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae; Nunc dictum vehicula semper. Phasellus interdum efficitur consequat. Quisque dignissim augue nunc, in maximus metus sollicitudin eu. Donec sed augue nunc. Nulla sodales, quam vel lobortis porttitor, augue velit aliquet sapien, dictum egestas odio elit sit amet nunc.",
      "createdAt": 1700740916000,
      "editedAt": 1701161700865,
      "tag": "10"
    },
    {
      "id": "2",
      "title": "Let's change this title",
      "content": "Nulla ac vehicula nulla, condimentum varius felis. Aliquam suscipit sodales leo sed suscipit. Sed nec velit arcu. Nam eu lectus diam. Pellentesque rhoncus mattis tincidunt. Maecenas molestie, velit vel auctor fringilla, nibh metus venenatis mauris, eget dignissim ex velit ut sem. Donec et quam fringilla, mattis massa eget, dignissim sem. Proin in ligula eget augue porta hendrerit. Curabitur fermentum blandit lorem nec vehicula. Maecenas semper, neque et commodo finibus, eros mauris tincidunt dolor, eu mattis ex erat eu neque. Proin id mi tortor. Praesent tempor, nunc at tincidunt pretium, ligula tortor tincidunt enim, vestibulum finibus ex purus quis mauris. Curabitur at erat vehicula ex luctus consequat. Nullam eu est ut lectus aliquet lobortis. Phasellus est nibh, euismod vel purus ac, sollicitudin lobortis velit. Donec vestibulum lectus a mauris lobortis, non sodales augue varius. Morbi commodo nisl ligula, sit amet varius libero egestas at. Nulla lacinia venenatis ipsum, quis porttitor lacus condimentum in. Nullam suscipit diam non iaculis aliquam. Nam hendrerit, massa eu bibendum pretium, augue sem sollicitudin libero, sed auctor magna quam eu ex. Suspendisse potenti. Nulla in tincidunt lorem, eget egestas magna. Duis volutpat pulvinar nunc, sit amet venenatis lectus sollicitudin vitae. In vel facilisis libero. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae; Nunc dictum vehicula semper. Phasellus interdum efficitur consequat. Quisque dignissim augue nunc, in maximus metus sollicitudin eu. Donec sed augue nunc. Nulla sodales, quam vel lobortis porttitor, augue velit aliquet sapien, dictum egestas odio elit sit amet nunc.",
      "createdAt": 1700821003206,
      "editedAt": 1701162467249,
      "tag": "6"
    },
    {
      "id": "3",
      "title": "Another amazing memo!",
      "content": "Leo sed suscipit. Sed nec velit arcu. Nam eu lectus diam. Pellentesque rhoncus mattis tincidunt. Maecenas molestie, velit vel auctor fringilla, nibh metus venenatis mauris, eget dignissim ex velit ut sem. Donec et quam fringilla, mattis massa eget, dignissim sem. Proin in ligula eget augue porta hendrerit. Curabitur fermentum blandit lorem nec vehicula. Maecenas semper, neque et commodo finibus, eros mauris tincidunt dolor, eu mattis ex erat eu neque. Proin id mi tortor. Praesent tempor, nunc at tincidunt pretium, ligula tortor tincidunt enim, vestibulum finibus ex purus quis mauris. Curabitur at erat vehicula ex luctus consequat. Nullam eu est ut lectus aliquet lobortis. Phasellus est nibh, euismod vel purus ac, sollicitudin lobortis velit. Donec vestibulum lectus a mauris lobortis, non sodales augue varius. Morbi commodo nisl ligula, sit amet varius libero egestas at. Nulla lacinia venenatis ipsum, quis porttitor lacus condimentum in. Nullam suscipit diam non iaculis aliquam. Nam hendrerit, massa eu bibendum pretium, augue sem sollicitudin libero, sed auctor magna quam eu ex. Suspendisse potenti. Nulla in tincidunt lorem, eget egestas magna. Duis volutpat pulvinar nunc, sit amet venenatis lectus sollicitudin vitae. In vel facilisis libero. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia curae; Nunc dictum vehicula semper. Phasellus interdum efficitur consequat. Quisque dignissim augue nunc, in maximus metus sollicitudin eu. Donec sed augue nunc. Nulla sodales, quam vel lobortis porttitor, augue velit aliquet sapien, dictum egestas odio elit sit amet nunc.",
      "createdAt": 1700750916000,
      "editedAt": 1701156775372,
      "tag": "11"
    }
  ],
  "tags": [
    {
      "id": "1",
      "name": "important",
      "icon": "⭐"
    },
    {
      "id": "2",
      "name": "soap",
      "icon": "🧼"
    },
    {
      "id": "3",
      "name": "party",
      "icon": "🎉"
    },
    {
      "id": "4",
      "name": "alien",
      "icon": "👽"
    },
    {
      "id": "5",
      "name": "pizza",
      "icon": "🍕"
    },
    {
      "id": "6",
      "name": "palmtree",
      "icon": "🌴"
    },
    {
      "id": "7",
      "name": "music",
      "icon": "🎵"
    },
    {
      "id": "8",
      "name": "dinosaur",
      "icon": "🦖"
    },
    {
      "id": "9",
      "name": "hamburger",
      "icon": "🍔"
    },
    {
      "id": "10",
      "name": "tulip",
      "icon": "🌷"
    },
    {
      "id": "11",
      "name": "parrot",
      "icon": "🦜"
    }
  ]
}